## Plan Result (prod-frontendappgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.frontendappgateway.azurerm_application_gateway.ag[0]
  * module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.frontendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw"
        name                = "cft-aks-fe-00-prod-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (4 unchanged attributes hidden)

      + backend_address_pool {
          + ip_addresses = [
              + "10.90.79.250",
              + "10.90.95.250",
            ]
          + name         = "et-sya"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "et-sya"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "et-sya"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }

      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "claim-employment-tribunals.service.gov.uk"
          + name                           = "et-sya"
          + protocol                       = "Http"
        }

      + probe {
          + host                                      = "claim-employment-tribunals.service.gov.uk"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "et-sya"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/adoption" -> null
          - backend_address_pool_name  = "adoption" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/adoption" -> null
          - backend_http_settings_name = "adoption" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/adoption" -> null
          - http_listener_name         = "adoption" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/adoption" -> null
          - name                       = "adoption" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/adoption"
          + backend_address_pool_name  = "adoption"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/adoption"
          + backend_http_settings_name = "adoption"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/adoption"
          + http_listener_name         = "adoption"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/adoption"
          + name                       = "adoption"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/cft-api-mgmt" -> null
          - backend_address_pool_name  = "cft-api-mgmt" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/cft-api-mgmt" -> null
          - backend_http_settings_name = "cft-api-mgmt" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/cft-api-mgmt" -> null
          - http_listener_name         = "cft-api-mgmt" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/cft-api-mgmt" -> null
          - name                       = "cft-api-mgmt" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/cft-api-mgmt"
          + backend_address_pool_name  = "cft-api-mgmt"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/cft-api-mgmt"
          + backend_http_settings_name = "cft-api-mgmt"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/cft-api-mgmt"
          + http_listener_name         = "cft-api-mgmt"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/cft-api-mgmt"
          + name                       = "cft-api-mgmt"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/cmc" -> null
          - backend_address_pool_name  = "cmc" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/cmc" -> null
          - backend_http_settings_name = "cmc" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/cmc" -> null
          - http_listener_name         = "cmc" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/cmc" -> null
          - name                       = "cmc" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/cmc"
          + backend_address_pool_name  = "cmc"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/cmc"
          + backend_http_settings_name = "cmc"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/cmc"
          + http_listener_name         = "cmc"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/cmc"
          + name                       = "cmc"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/cmc-legal" -> null
          - backend_address_pool_name  = "cmc-legal" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/cmc-legal" -> null
          - backend_http_settings_name = "cmc-legal" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/cmc-legal" -> null
          - http_listener_name         = "cmc-legal" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/cmc-legal" -> null
          - name                       = "cmc-legal" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/cmc-legal"
          + backend_address_pool_name  = "cmc-legal"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/cmc-legal"
          + backend_http_settings_name = "cmc-legal"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/cmc-legal"
          + http_listener_name         = "cmc-legal"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/cmc-legal"
          + name                       = "cmc-legal"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/div-amend" -> null
          - backend_address_pool_name  = "div-amend" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/div-amend" -> null
          - backend_http_settings_name = "div-amend" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/div-amend" -> null
          - http_listener_name         = "div-amend" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/div-amend" -> null
          - name                       = "div-amend" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/div-amend"
          + backend_address_pool_name  = "div-amend"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/div-amend"
          + backend_http_settings_name = "div-amend"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/div-amend"
          + http_listener_name         = "div-amend"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/div-amend"
          + name                       = "div-amend"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/div-da" -> null
          - backend_address_pool_name  = "div-da" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/div-da" -> null
          - backend_http_settings_name = "div-da" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/div-da" -> null
          - http_listener_name         = "div-da" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/div-da" -> null
          - name                       = "div-da" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationG

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

       + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/sscs-tribunals"
          + backend_address_pool_name  = "sscs-tribunals"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/sscs-tribunals"
          + backend_http_settings_name = "sscs-tribunals"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/sscs-tribunals"
          + http_listener_name         = "sscs-tribunals"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/sscs-tribunals"
          + name                       = "sscs-tribunals"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/sscs-tya" -> null
          - backend_address_pool_name  = "sscs-tya" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/sscs-tya" -> null
          - backend_http_settings_name = "sscs-tya" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/sscs-tya" -> null
          - http_listener_name         = "sscs-tya" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/sscs-tya" -> null
          - name                       = "sscs-tya" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/sscs-tya"
          + backend_address_pool_name  = "sscs-tya"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/sscs-tya"
          + backend_http_settings_name = "sscs-tya"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/sscs-tya"
          + http_listener_name         = "sscs-tya"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/sscs-tya"
          + name                       = "sscs-tya"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-approve-org" -> null
          - backend_address_pool_name  = "xui-approve-org" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-approve-org" -> null
          - backend_http_settings_name = "xui-approve-org" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-approve-org" -> null
          - http_listener_name         = "xui-approve-org" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-approve-org" -> null
          - name                       = "xui-approve-org" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-approve-org"
          + backend_address_pool_name  = "xui-approve-org"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-approve-org"
          + backend_http_settings_name = "xui-approve-org"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-approve-org"
          + http_listener_name         = "xui-approve-org"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-approve-org"
          + name                       = "xui-approve-org"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-manage-org" -> null
          - backend_address_pool_name  = "xui-manage-org" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-manage-org" -> null
          - backend_http_settings_name = "xui-manage-org" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-manage-org" -> null
          - http_listener_name         = "xui-manage-org" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-manage-org" -> null
          - name                       = "xui-manage-org" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-manage-org"
          + backend_address_pool_name  = "xui-manage-org"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-manage-org"
          + backend_http_settings_name = "xui-manage-org"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-manage-org"
          + http_listener_name         = "xui-manage-org"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-manage-org"
          + name                       = "xui-manage-org"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-register-org" -> null
          - backend_address_pool_name  = "xui-register-org" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-register-org" -> null
          - backend_http_settings_name = "xui-register-org" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-register-org" -> null
          - http_listener_name         = "xui-register-org" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-register-org" -> null
          - name                       = "xui-register-org" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-register-org"
          + backend_address_pool_name  = "xui-register-org"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-register-org"
          + backend_http_settings_name = "xui-register-org"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-register-org"
          + http_listener_name         = "xui-register-org"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-register-org"
          + name                       = "xui-register-org"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-webapp" -> null
          - backend_address_pool_name  = "xui-webapp" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-webapp" -> null
          - backend_http_settings_name = "xui-webapp" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-webapp" -> null
          - http_listener_name         = "xui-webapp" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-webapp" -> null
          - name                       = "xui-webapp" -> null
          - rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendAddressPools/xui-webapp"
          + backend_address_pool_name  = "xui-webapp"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/backendHttpSettingsCollection/xui-webapp"
          + backend_http_settings_name = "xui-webapp"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/httpListeners/xui-webapp"
          + http_listener_name         = "xui-webapp"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/requestRoutingRules/xui-webapp"
          + name                       = "xui-webapp"
          + rewrite_rule_set_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-sya"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-sya"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-sya"
          + id                         = (known after apply)
          + name                       = "et-sya"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (156 unchanged blocks hidden)
    }

  # module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1204,"Program":"tfcmt","SHA1":"","Target":"prod-frontendappgateway","Vars":{}} -->